---
kind: method
id: M:Autodesk.Revit.DB.CurveLoop.NumberOfCurves
source: html/1b5d6569-0550-4113-f8d1-3cc94201c5a4.htm
---
# Autodesk.Revit.DB.CurveLoop.NumberOfCurves Method

Returns the number of curves in the curve loop.

## Syntax (C#)
```csharp
public int NumberOfCurves()
```

## Returns
The number of curves in the curve loop.